OdDAI.ErrorEvent.makeErrorEvent(System.UInt32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates an error event with the specified function, error code and description.
\param errorId      [in] Error code.
\param description  [in] Error event description in a human-readable form.
\param functionName [in] Pointer to a name of the function for the event.
\returns
Smart pointer to the created event.

OdDAI.ErrorEvent.description
\details
Retrieves description of an error event.
\returns
Const char pointer to description text of an error event.

OdDAI.ErrorEvent.error
\details
Retrieves error code of the event.
\returns
Error code as daiErrorId value.

OdDAI.ErrorEvent.testAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves whether the attribute value is set or is unset.
\param explicitAttrName [in] An ANSI string that contains the attribute name.
\returns Returns true if the attribute has a value; otherwise, the method returns false (it means that the attribute value is not set).

OdDAI.ErrorEvent.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.ErrorEvent.op_Assign(OdDAI.ErrorEvent!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the ErrorEvent class.
\param other            [in] Error event to assign.
\remarks
Inaccessible.

OdDAI.ErrorEvent.#ctor(OdDAI.ErrorEvent!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Copy constructor for the ErrorEvent class.
\param other            [in] Error event to copy.
\remarks
Inaccessible.

OdDAI.ErrorEvent.Dispose
\details
Destructor for the ErrorEvent class.

OdDAI.ErrorEvent.#ctor
\details
Default constructor for the ErrorEvent class. By default an error comes from the underlying system.